Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_es.ditamap.tmx
Source language: en
Languages: es

source: Remove Initial/Trailing Spaces : remove spaces at the start and end of all language entries.
es: Eliminar Espacios Iniciales y Finales : elimina los espacios al principio y al final de todas las entradas de idioma.

source: Consolidate Units : merge translation units that share a common source language entry.
es: Consolidar Unidades : combina unidades de traducción que comparten una entrada de idioma de origen común.

source: If you selected Remove Untranslated Units or Consolidate Units , select the source language of the TMX file using the Source Language drop-down.
es: Si seleccionó Eliminar Unidades Duplicadas o Consolidar Unidades , seleccione el idioma origen del archivo TMX mediante la lista desplegable Idioma Origen .

source: Click the Perform Maintenance button.
es: Haga clic en el botón Realizar Mantenimiento .

source: A maintenance process is started and an indicator is displayed on screen while all selected tasks are performed.
es: Se inicia un proceso de mantenimiento y se muestra un indicador en la pantalla mientras se realizan todas las tareas seleccionadas.

source: Follow these steps to merge the content of two or more TMX files into a larger one.
es: Siga estos pasos para combinar el contenido de dos o más archivos TMX en uno más grande.

source: In main menu, select File Merge TMX Files... .
es: En el menú principal, seleccione Archivo Combinar Archivos TMX... .

source: Merge TMX Files Dialog
es: Cuadro de diálogo Combinar Archivos TMX

source: Enter the name of the file that will contain all merged data in the Merged TMX File text box or click the Browse... button to select a file from the file system.
es: Escriba el nombre del archivo TMX que contendrá todos los datos combinados en el cuadro de texto Archivo TMX Combinado o utilice el botón Examinar... para seleccionar un archivo del sistema de archivos.

source: Use the Add Files button to select the files to be merged from the file system.
es: Utilice el botón Añadir Archivos para seleccionar los archivos que se van a combinar desde el sistema de archivos.

source: The dialog shows added files:
es: El dialogo muestra los archivos añadidos:

source: If you want to remove files from the list, click the corresponding Remove File buttons ( ) on the leftmost column.
es: Si desea eliminar archivos de la lista, haga clic en los correspondientes botones Eliminar Archivo ( ) de la columna situada más a la izquierda.

source: Click the Merge TMX Files button.
es: Haga clic en el botón Combinar Archivos TMX .

source: A progress dialog is displayed while a TMX file containing data from all selected files is created in the indicated location.
es: Se muestra un indicador de progreso mientras se crea un archivo TMX que contiene datos de todos los archivos seleccionados en la ubicación indicada.

source: Program Settings
es: Configuración del Programa

source: Open the preferences dialog:
es: Abra el cuadro de diálogo de preferencias:

source: On Windows or Linux menu, select Settings Preferences .
es: En el menú de Windows o Linux, seleccione Configuración Preferencias .

source: On macOS main menu, select TMXEditor Preferences... Settings .
es: En el menú principal de macOS, seleccione TMXEditor Preferences... Configuración .

source: Use the Application Language drop-down to select the language used in TMXEditor graphical user interface.
es: Utilice la lista desplegable Idioma de la Aplicación para seleccionar el idioma utilizado en la interfaz gráfica de usuario de TMXEditor.

source: Changes to the application language will take effect after you restart the program.
es: Los cambios en el idioma de la aplicación surtirán efecto después de reiniciar el programa.

source: Use the Theme drop-down to select the colors used in the graphical user interface. Available options are:
es: Utilice el menú desplegable Tema para seleccionar los colores utilizados en la interfaz gráfica de usuario. Las opciones disponibles son:

source: System Default : automatically selects Dark or Light colors according to the preferences set in the operating system.
es: Predeterminado del sistema : selecciona automáticamente los colores oscuros o claros según las preferencias establecidas en el sistema operativo.

source: Dark : Uses dark background with white text.
es: Oscuro : utiliza fondo oscuro con texto blanco.

source: Light : Uses light grey background with dark text.
es: Claro : utiliza fondo gris claro con texto oscuro.

source: High Contrast : Dark theme with enhanced contrast.
es: Alto Contraste : tema oscuro con contrasete mejorado.

source: Select the number of spaces used to indent XML elements in the TMX file using the Indentation selector.
es: Ingrese el número de espacios utilizados para aplicar sangría a los elementos XML del archivo TMX mediante el selector de Sangría .

source: Note : Indentation helps in visually understanding the structure of an XML file when viewing it as plain text but is not required for processing TMX files with translation tools.
es: Nota : La sangría ayuda a comprender visualmente la estructura de un archivo XML cuando se visualiza como texto sin formato, pero no es necesaria para procesar archivos TMX con herramientas de traducción.

source: Select the Set 'changeid' / 'changedate' Attributes checkbox if you want to enable the registration of the user who last modified an item or file and the date the change was made.
es: Seleccione la casilla Establecer Atributos 'changeid' / 'changedate' si desea habilitar el registro del usuario que modificó por última vez un elemento o archivo y la fecha en que se realizó el cambio.

source: Click the Save Preferences button to save and activate selected settings.
es: Haga clic en el botón Guardar Preferencias para guardar y activar la configuración seleccionada.

source: Theme changes are applied immediately. Changing the application language requires a restart. Memory usage settings are applied when a new TMX file is opened. Indentation is applied the next time a file is saved.
es: Los cambios de tema se aplican inmediatamente. Cambiar el idioma de la aplicación requiere un reinicio. La configuración de uso de memoria se aplica cuando se abre un nuevo archivo TMX. La sangría se aplica la próxima vez que se guarda un archivo.

source: Follow these steps to remove duplicated entries in a TMX file.
es: Siga estos pasos para eliminar unidades duplicadas de un archivo TMX.

source: Duplicated translation units increase the size of a TMX file and slow down TM searches.
es: Las unidades de traducción duplicadas aumentan el tamaño de un archivo TMX y ralentizan las búsquedas de TM.

source: In main menu, select Tasks Remove Duplicated Units .
es: En el menú principal, seleccione Tareas Eliminar Unidades Duplicadas .

source: A progress dialog is displayed while duplicated units are removed. The editing window is refreshed to reflect the changes.
es: Se muestra un indicador de progreso mientras se eliminan unidades duplicadas. La ventana de edición se actualiza para reflejar los cambios.

source: Follow these steps to remove a language from a TMX file.
es: Siga estos pasos para eliminar un idioma de un archivo TMX.

source: In main menu, select Tasks Remove Language... option.
es: En el menú principal, seleccione Tareas Eliminar Idioma... .

source: Remove Language Dialog
es: Cuadro de diálogo Eliminar Idioma

source: Use the drop-down box to select the language to remove.
es: Use la lista desplegable para seleccionar el idioma a eliminar.

source: Click the Remove Language button.
es: Haga clic en el botón Eliminar Idioma .

source: Follow these steps to remove translation entries that are the same as source entry from a TMX file.
es: Siga estos pasos para eliminar entrados cuyas traducciones son iguales al texto origen en un archivo TMX.

source: Translation units may contain one or more language entries that are equal to the entry designated as source. If in a given unit all entries have the same content, this procedure removes the entire unit. If at least one language entry is different from source, the unit is preserved containing only translations that are different from source.
es: Las unidades de traducción pueden contener una o varias entradas de idioma iguales a la entrada designada como origen. Si en una unidad dada todas las entradas tienen el mismo contenido, este procedimiento elimina toda la unidad. Si al menos una entrada de idioma es diferente de la de origen, se conserva la unidad que contiene sólo las traducciones que son diferentes de la de origen.

source: In main menu, seect Tasks Remove Translation Same as Source... option.
es: En el menú principal, seleccione Tareas Eliminar Traducciones Iguales a Origen... .

source: Remove Translation Same as Source Dialog
es: Cuadro de diálogo Eliminar Traducciones Iguales a Origen

source: Use the Source Language drop-down to select the language to be considered language for removing units (it may differ from the source language set at file level).
es: Utilice la lista desplegable Idioma Origen para seleccionar el idioma que se considerará idioma origen para eliminar unidades (puede diferir del idioma de origen establecido a nivel de archivo).

source: Click the Remove Translation Same as Source button.
es: Haga clic en el botón Eliminar Traducciones Iguales a Origen .

source: A progress dialog is displayed while translation enties that are equal to source are removed.
es: Se muestra un indicador de progreso mientras se eliminan las traducciones que son iguales al origen.

source: The editing window is refreshed to reflect the changes.
es: La ventana de edición se actualiza para reflejar los cambios.

source: Follow these steps to remove initial and trailing spaces from all segments of a TMX file.
es: Siga estos pasos para quitar los espacios iniciales y finales de todos los segmentos de un archivo TMX.

source: Leading or trailing spaces may affect the match quality rating of matches retrieved from a translation memory system.
es: Los espacios iniciales o finales pueden afectar el valor de similitud en las coincidencias recuperadas de un sistema de memoria de traducción.

source: In main menu, select Tasks Remove Initial/Trailing Spaces .
es: En el menú principal, seleccione Tareas Eliminar Espacios Iniciales/Finales .

source: A progress dialog is displayed while spaces are removed. The editing window is refreshed to reflect the changes.
es: Se muestra un indicador de progreso mientras se eliminan espacios. La ventana de edición se actualiza para reflejar los cambios.

source: Follow these steps to remove inline tags from a TMX file.
es: Siga estos pasos para eliminar etiquetas de un archivo TMX.

source: The presence of inline tags may have an adverse effect when retrieving TM matches if a penalty is applied for missing or differences in inline tags.
es: La presencia de etiquetas puede tener un efecto adverso a la hora de recuperar coincidencias de TM si se aplica una penalización por falta o diferencias en las etiquetas.

source: Open the TMX file that you want to clean.
es: Abra el archivo TMX que desea procesar.

source: In main menu, select Tasks Remove All Tags .
es: En el menú principal, seleccione Tareas Eliminar Todas las Etiquetas .

source: A progress dialog is displayed while inline tags are removed. The editing window is refreshed to reflect the changes.
es: Se muestra un indicador de progreso mientras se eliminan etiquetas. La ventana de edición se actualiza para reflejar los cambios.

source: Remove Untranslated Units
es: Eliminar Unidades No Traducidas

source: Follow these steps to remove untranslated units from a TMX file.
es: Siga estos pasos para eliminar unidades no traducidas de un archivo TMX.

source: A translation unit that has just one <tuv> element that contains text is considered "untranslated". Untranslated units are hardly useful for retrieving matches from a Translation Memory system.
es: Una unidad de traducción que tiene un solo elemento <tuv> que contiene texto se considera "sin traducir". Las unidades no traducidas no son útiles para recuperar coincidencias de un sistema de Memoria de Traducción .

source: In main menu, seect Tasks Remove Untranslated Units... .
es: En el menú principal, seleccione Tareas Eliminar Unidades No Traducidas... .

source: Remove Untranslated Units Dialog
es: Cuadro de diálogo Eliminar Unidades No Traducidas

source: Click the Remove Untranslated Units button.
es: Haga clic en el botón Eliminar Unidades No Traducidas .

source: A progress dialog is displayed while untranslated units are removed.
es: Se muestra un indicador de progreso mientras se eliminan las unidades no traducidas.

source: Follow these steps perform a global search & replace operation.
es: Siga estos pasos para realizar una operación global de búsqueda y reemplazo.

source: In main menu, select Edit Replace Text... ([ Ctrl+F ] on Windows/Linux, [ Cmd+F ] on macOS) or click the Replace Text... button on the top toolbar.
es: En el menú principal, seleccione Editar Reemplazar Texto... ([ Ctrl+F ] en Windows/Linux, [ Cmd+F ] en macOS) o haga clic en el botón Reemplazar Texto... de la barra de herramientas superior.

source: Replace Text Dialog
es: Cuadro de diálogo Reemplazar Texto

source: Enter the text to replace in the Text to Search text box.
es: Escriba el texto que desea reemplazar en el cuadro de texto Texto a Buscar .

source: Enter the replacement text in the Replace With text box.
es: Escriba el texto de reemplazo en el cuadro de texto Reemplazar con .

source: Use the Language drop-down to select the language column where the replacement should be performed.
es: Utilice la lista desplegable Idioma para seleccionar la columna de idioma donde se debe realizar el reemplazo.

source: Select the Regular Expression checkbox if you want to use regular expressions for specifying the text to search
es: Active la casilla Expresión Regular si desea utilizar expresiones regulares para especificar el texto que se va a buscar

source: Click the Replace Text button.
es: Haga clic en el botón Reemplazar Texto .

source: All exact appearances of the text in Text to Search , or fragments that match the given regular expression, are replaced with the text specified in the Replace With text box.
es: Todas las entradas exactas del texto en Texto a buscar , o fragmentos que coincidan con la expresión regular dada, se reemplazan con el texto especificado en el cuadro de texto Reemplazar con .

source: Follow these steps to display the entries of your TMX file sorted on a selected language.
es: Siga estos pasos para mostrar las entradas del archivo TMX ordenadas en un idioma seleccionado.

source: Data in a TMX file is stored without a particular order. Sometimes it may be useful to sort data according to a given language to facilitate editing.
es: Los datos en un archivo TMX se almacenan sin un orden particular. A veces puede ser útil ordenar los datos según un idioma determinado para facilitar la edición.

source: Follow these steps to sort the content of a TMX file for review.
es: Siga estos pasos para ordenar el contenido de un archivo TMX para su revisión.

source: In main menu, select View Sort Translation Units option ([ F5 ]) or click on the Sort Translation Units button on the top toolbar.
es: En el menú principal, seleccione la opción Ver Ordenar Unidades de Traducción ([ F5 ]) o haga clic en el botón Ordenar Unidades de Traducción de la barra de herramientas superior.

source: Sort Translation Units Dialog
es: Cuadro de diálogo Ordenar Unidades de Traducción

source: Use the Sort Language drop-down to select the language used for sorting the file.
es: Utilice la lista desplegable Idioma de Ordenamiento para seleccionar el idioma utilizado para ordenar el archivo.

source: Select the Sort Descending checkbox if you want the units sorted in descending order. Clear the checkbox otherwise.
es: Active la casilla Orden Descendente si desea que las unidades se ordenen en orden descendente. Desactive la casilla de verificación de lo contrario.

source: Click the Sort Translation Units button.
es: Haga clic en el botón Ordenar Unidades de Traducción .

source: All units will be sorted according to the selected language. To display all units in the original order, reopen the dialog and click the Clear Sorting button.
es: Todas las unidades se ordenarán según el idioma seleccionado. Para mostrar todas las unidades en el orden original, vuelva a abrir el cuadro de diálogo y haga clic en el botón Cancelar Ordenamiento .

source: Follow these steps to split a TMX file in two or more parts.
es: Siga estos pasos para dividir un archivo TMX en dos o más partes.

source: Sometimes a TMX file may be too big to be processed and splitting it into smaller pieces may help.
es: A veces, un archivo TMX puede ser demasiado grande para ser procesado y dividirlo en partes más pequeñas puede ayudar.

source: In main menu, select File Split TMX File... .
es: En el menú principal, seleccione Archivo Dividir Archivo TMX... .

source: Split TMX File Dialog
es: Cuadro de diálogo Dividir Archivo TMX

source: Enter the full name of the file to split in the TMX File box or click the Browse... button to select the file from the file system.
es: Escriba el nombre del archivo TMX en el cuadro de texto Archivo TMX o utilice el botón Examinar... para seleccionar el archivo del sistema de archivos.

source: Select the number of parts in which you want to split the file.
es: Seleccione el número de partes en las que desea dividir el archivo.

source: Click the Split TMX File button.
es: Haga clic en el botón Dividir Archivo TMX .

source: A progress dialog is displayed while the selected TMX file is split into the indicated number of smaller TMX files that are created in the same folder. The original document is left unchanged.
es: Aparece un indicador de progreso mientras el archivo TMX seleccionado se divide en el número indicado de archivos TMX más pequeños que se crean en la misma carpeta. El documento original no se modifica.

source: First Registration - Evaluation Request
es: Primer Registro - Solicitud de Evaluación

source: When you open TMXEditor from the official installers for the first time, or when the Subscription Key is not registered, the following dialog is displayed:
es: Cuando abre TMXEditor desde los instaladores oficiales por primera vez, o cuando la clave de suscripción no está registrada, se muestra el siguiente cuadro de diálogo:

source: Register Subscription Dialog
es: Cuadro de diálogo Registrar Suscripción

source: If you have a Subscription Key, type it in the Subscription Key text box and click the Register Subscription button.
es: Si tiene una clave de suscripción, escríbala en el cuadro de texto Clave de Suscripción y haga clic en el botón Registrar Suscripción .

source: On registration success, the main editing screen will be presented.
es: Si el registro se realiza correctamente, aparecerá la pantalla principal de edición.

source: If you don't have a Subscription Key and wish to test the program during 7 days, click the Request Evaluation Key button.
es: Si no tiene una clave de suscripción y desea probar el programa durante 7 días, haga clic en el botón Solicitar Clave de Evaluación .

source: Request Evaluation Key Dialog
es: Cuadro de diálogo Solicitar Clave de Evaluación

source: Enter the requested data and click the Request Evaluation Key button.
es: Escriba los datos solicitados y haga clic en el botón Solicitar Clave de Evaluación .

source: On success, an email with the requested Evaluation Key will be sent to the indicated address and the following dialog will be displayed:
es: Si tiene éxito, se enviará un correo electrónico con la Clave de Evaluación solicitada a la dirección indicada y se mostrará el siguiente cuadro de diálogo:

source: Request Received Dialog
es: Cuadro de diálogo Solicitud Recibida

source: Check your email and register the Evaluation Key using the instructions shown above.
es: Compruebe su correo electrónico y registre la Clave de Evaluación siguiendo las instrucciones indicadas anteriormente.

source: Subscription Renewal
es: Renovación de Suscripción

source: You can register a new subscription key before your existing subscription expires.
es: Puede registrar una nueva Clave de Suscripción antes de que caduque su suscripción existente.

source: In main menu, select Help Register Subscription... .
es: En el menú principal, seleccione Ayuda Registrar Suscripción... .

source: If you don't have a subscription key yet, click on the Purchase Subscription button to open Maxprograms Online Store on your internet browser.
es: Si no tiene una clave de suscripción, haga clic en el botón Comprar Suscripción para abrir la tienda en línea de Maxprograms en su navegador de Internet.

source: On registration success, The following dialog appears:
es: Si el registro se realiza correctamente, aparece el siguiente cuadro de diálogo:

source: Subscription Registered Dialog
es: Cuadro de diálogo Suscripción Registrada

source: TMX Validation
es: Validación de TMX

source: Most CAT (Computer Aided Translation) tools rely on TMX (Translation Memory eXchange) standard to exchange translation memory data. Unfortunately, some tools produce files that are not valid and others do not accept TMX documents that are correctly formatted.
es: La mayoría de las herramientas TAO (traducción Asistida por Ordenador) se basan en la norma TMX (Translation Memory eXchange) para intercambiar datos de memorias de traducción. Por desgracia, algunas herramientas producen archivos que no son válidos y otras no aceptan documentos TMX que estén correctamente formateados.

source: TMXEditor checks the validity of TMX files against TMX DTD and also verifies if they follow the requirements described in TMX specifications.
es: TMXEditor comprueba la validez de los archivos TMX frente a TMX DTD y también verifica si siguen los requisitos descritos en las especificaciones TMX.

source: In main menu, select File Validate TMX File... .
es: En el menú principal, seleccione Archivo Validar Archivo TMX... .

source: Use the dialog that appears to locate and select the file that you want to validate.
es: Utilice el cuadro de diálogo que aparece para localizar y seleccionar el archivo que desea validar.

source: A progress dialog is displayed while the file is analyzed.
es: Se muestra un indicador de progreso mientras se analiza el archivo.

source: After checking the TMX file, a dialog with validation results appears.
es: Tras comprobar el archivo TMX, aparece un cuadro de diálogo con los resultados de la validación.
